Тест_ЗУП_31_КОРП/src/Documents/ИсключениеИзКадровогоРезерва/ИсключениеИзКадровогоРезерва.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИсключениеИзКадровогоРезерва</name>
  <registerRecords>InformationRegister.ИсторияКадровогоРезерва</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсключения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Резерв</name>
    <attributes>
      <name>ПозицияРезерва</name>
      <type>
        <types>CatalogRef.КадровыйРезерв</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРезерва</name>
      <type>
        <types>CatalogRef.ВидыКадровогоРезерва</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ДействияСКадровымиРезервистами</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СостоянияСогласования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Enums/ДействияСКадровымиРезервистами/ДействияСКадровымиРезервистами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДействияСКадровымиРезервистами</name>
  <enumValues>
    <name>Утвердить</name>
  </enumValues>
  <enumValues>
    <name>Отклонить</name>
  </enumValues>
  <enumValues>
    <name>Оставить</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Documents/ИсключениеИзКадровогоРезерва/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс	
	
// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаДокумента.
Функция ОписаниеСоставаДокумента() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ИсключениеИзКадровогоРезерва;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаДокументаПоМетаданнымФизическоеЛицоВШапке(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения(Ссылка)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсключениеИзКадровогоРезерва.ДатаИсключения КАК Период,
		|	ИсключениеИзКадровогоРезерва.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсключениеИзКадровогоРезерваРезерв.ПозицияРезерва КАК ПозицияРезерва,
		|	ИсключениеИзКадровогоРезерваРезерв.ВидРезерва КАК ВидРезерва,
		|	ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.ПустаяСсылка) КАК Статус
		|ИЗ
		|	Документ.ИсключениеИзКадровогоРезерва.Резерв КАК ИсключениеИзКадровогоРезерваРезерв
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсключениеИзКадровогоРезерва КАК ИсключениеИзКадровогоРезерва
		|		ПО ИсключениеИзКадровогоРезерваРезерв.Ссылка = ИсключениеИзКадровогоРезерва.Ссылка
		|ГДЕ
		|	ИсключениеИзКадровогоРезерваРезерв.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСКадровымиРезервистами.Отклонить)
		|	И ИсключениеИзКадровогоРезерва.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ДвиженияИсторииКадровогоРезерва = РезультатЗапроса.Выгрузить();
	
	ДанныеДляПроведения = Новый Структура;
	ДанныеДляПроведения.Вставить("ДвиженияИсторииКадровогоРезерва", ДвиженияИсторииКадровогоРезерва);
	
	Возврат ДанныеДляПроведения;

КонецФункции	

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
